
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование + ?(ЗначениеЗаполнено(Данные.ДействуетНаОсновании), 
	                                        СтрШаблон(" (на основании %1)", Данные.ДействуетНаОсновании), 
											"");
	
КонецПроцедуры

#КонецОбласти