#Область ПрограммныйИнтерфейс

// Добавляет на форму документа поле для ввода контактного лица
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить поле ввода.
//
Процедура ДобавитьКонтактноеЛицоНаФорму(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	ДобавитьОтбор = Ложь;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьОтбор = Истина;
		КонтактноеЛицо = ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьОтбор = Истина;
		КонтактноеЛицо = ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьОтбор = Истина;
		КонтактноеЛицо = ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьОтбор = Истина;
		КонтактноеЛицо = ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьОтбор = Истина;
		КонтактноеЛицо = ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;

	Если ДобавитьОтбор Тогда
		ПараметрыОтбора = Новый Массив;
		ПараметрыОтбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
		Связи = Новый ФиксированныйМассив(ПараметрыОтбора);
		КонтактноеЛицо.СвязиПараметровВыбора = Связи;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	КонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ЗаполнитьСвойстваЭлемента(КонтактноеЛицо);
	Возврат КонтактноеЛицо;
	
КонецФункции

Функция ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма)
	
	КонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ЗаполнитьСвойстваЭлемента(КонтактноеЛицо);
	Возврат КонтактноеЛицо;
	
КонецФункции

Процедура ЗаполнитьСвойстваЭлемента(КонтактноеЛицо)
	КонтактноеЛицо.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	КонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
КонецПроцедуры
	
#КонецОбласти